// Chapter02-5_RefPtr.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>
using namespace std;

/*
* 포인터 변수도 변수이기 때문에 참조자의 선언이 가능하다.
*/
int main()
{
    int num = 12;
    int* ptr = &num;
    int** dptr = &ptr;

    /*
    * 포인터 변수의 참조자 선언도 &연산자를 하나 더 추가하는 형태로 진행된다.
    */
    int& ref = num;
    int* (&pref) = ptr;
    int** (&dpref) = dptr;

    cout << ref << endl;
    cout << *pref << endl;      // pref는 포인터 변수 ptr의 참조자이므로, 변수 num에 저장된 값이 출력된다.
    cout << **dpref << endl;    // dpref는 포인터 변수 dptr의 참조자이므로, 변수 num에 저장된 값이 출력된다.

    return 0;
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
